In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
a = pd.Series(["Leena", "Maha", "Soso"], index=[1, 2,3])
a

1    Leena
2     Maha
3     Soso
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
a.index=[11, 12, 13]
a

11    Leena
12     Maha
13     Soso
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
a.iloc[0:2]

11    Leena
12     Maha
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [5]:
b = a.append(pd.Series(["Leena", "Maha"]))
b

/var/folders/6n/rhnjlfdn42sfzqk04k7rf6980000gn/T/ipykernel_6289/2244471310.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  b = a.append(pd.Series(["Leena", "Maha"]))

11    Leena
12     Maha
13     Soso
0     Leena
1      Maha
dtype: object

In [6]:
b.drop_duplicates()

11    Leena
12     Maha
13     Soso
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [7]:
students_df = pd.DataFrame([71, 52, 11], ["Leena", "Maha", "Soso"])
students_df

        0
Leena  71
Maha   52
Soso   11

## Q6: Read educ_figdp_1_Data.csv file

In [8]:
edu = pd.read_csv("educ_figdp_1_Data.csv").set_index(["TIME"])

edu

,GEO,INDIC_ED,Value,Flag and Footnotes
TIME,,,,
2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...
2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

`.loc` is a label based method whereas `.iloc` is an integer-based method. This means that `iloc` will consider the names or labels of the index when we are slicing the dataframe.

`.iloc` takes slices based on index’s position. Unlike `.loc`, `.iloc` behaves like regular Python slicing. That is, we just indicate the positional index number, and we get the slice we want.

In [9]:
edu[1:3]

,GEO,INDIC_ED,Value,Flag and Footnotes
TIME,,,,
2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [10]:
edu.loc[2001]

,GEO,INDIC_ED,Value,Flag and Footnotes
TIME,,,,
2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
2001,European Union (25 countries),Total public expenditure on education as % of ...,5.02,s
2001,Euro area (18 countries),Total public expenditure on education as % of ...,:,NaN
2001,Euro area (17 countries),Total public expenditure on education as % of ...,:,NaN
2001,Euro area (15 countries),Total public expenditure on education as % of ...,4.98,s
2001,Euro area (13 countries),Total public expenditure on education as % of ...,4.97,s
2001,Belgium,Total public expenditure on education as % of ...,5.99,i
2001,Bulgaria,Total public expenditure on education as % of ...,3.70,NaN
2001,Czech Republic,Total public expenditure on education as % of ...,3.93,NaN
2001,Denmark,Total public expenditure on education as % of ...,8.44,d
2001,Germany (until 1990 former territory of the FRG),Total public expenditure on education as % of ...,4.51,NaN
2001,Estonia,Total public expenditure on education as % of ...,5.24,NaN
2001,Ireland,Total public expenditure on education as % of ...,4.24,NaN
2001,Greece,Total public expenditure on education as % of ...,3.50,i
2001,Spain,Total public expenditure on education as % of ...,4.24,NaN
2001,France,Total public expenditure on education as % of ...,5.95,NaN
2001,Italy,Total public expenditure on education as % of ...,4.83,NaN
2001,Cyprus,Total public expenditure on education as % of ...,5.98,i
2001,Latvia,Total public expenditure on education as % of ...,7.22,NaN
2001,Lithuania,Total public expenditure on education as % of ...,5.86,NaN
2001,Luxembourg,Total public expenditure on education as % of ...,3.75,d
2001,Hungary,Total public expenditure on education as % of ...,5.06,NaN
2001,Malta,Total public expenditure on education as % of ...,4.27,NaN
2001,Netherlands,Total public expenditure on education as % of ...,5.09,NaN
2001,Austria,Total public expenditure on education as % of ...,5.74,NaN
2001,Poland,Total public expenditure on education as % of ...,5.42,i
2001,Portugal,Total public expenditure on education as % of ...,5.39,d
2001,Romania,Total public expenditure on education as % of ...,3.25,NaN
2001,Slovenia,Total public expenditure on education as % of ...,5.86,NaN
2001,Slovakia,Total public expenditure on education as % of ...,3.99,d
2001,Finland,Total public expenditure on education as % of ...,6.06,NaN

In [11]:
edu.iloc[1:3]

,GEO,INDIC_ED,Value,Flag and Footnotes
TIME,,,,
2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e